# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Post-modern modal text editor
brew "helix"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Review-first terminal diff viewer for agent-authored changesets
brew "hunk"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terminal-based AI coding assistant
cask "claude-code"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Native terminal coding agents command center
cask "supacode"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
uv "tau-ai"
npm "@earendil-works/pi-coding-agent"
npm "corepack"
